/* divide.c -- деление , каким мы его знаем */
#include <stdio.h>

int main(void)
{
    printf ( " Целочисленно е дел ение : 5/4 равно %d \n",                     5 / 4);
    printf ( " Целочисленно е дел ение : 6/3 равно %d \n",                      6 / 3);
    printf ( " Целочисленно е деление : 7/4 равно %d \n",                       7 / 4);
    printf ( " Деление с плавающей запя той : 7./4. равно %1.2f \n",            7.0 / 4.0);
    printf ( " Смешанное деление : 7.0/4 равно %1.2f \n",                      7.0 / 4); 

    return 0;
}